H                                               
D                                               
 /free                                          
   DSPLY 'Program calling successful';          
   *inlr = *on;                                 
 /end-free                                      
